#---------Биринчи тапшырма------------#
# Азамат информатика сабагын жакшы көрүп окуйт, ошондуктан жакында эле "Окурмэн" окуу борборунда Python курсун окуп баштады. 
# Аларга мектептен сандын калдыгы жана бүтүн бөлүгү жөнүндө тема өттү.
# Үйүнө шашып келген Азамат, кез келген сандын цифраларынын суммасын эсептөөчү программа түзүүгө аракет кылды.
# Бирок IT курсунда жаңыдан окуп баштагандыктан мындай программа түзүү ага кыйынчылык жаратты. Ал бизден жардам сурап кайрылды.  
# Бизге бир n саны берилет(0 < n) жана бизден ал сандын цифраларынын суммасын чыгарып берген программа түзүү керектелет.- 

# n = int(input("Бир сан жазыңыз: ")) # 
# sum_digits = 0 # Сандын цифраларынын суммасын бул өзгөрмөгө сактайбыз 
# while n > 0:  # Цикл n > 0 болгон учурда гана иштөөсүн улантат  
#     sum_digits += n % 10  # Сандын акыркы цифрасын алабыз жана суммага кошобуз.
#     n //= 10  # Сандын акыркы цифрасынан башкасын алабыз 
# print("n санынын цифраларынын суммасы:", sum_digits) # Экранга n санынын цифраларынын суммасын чыгарабыз


                   ####### "2-тапшырма"

# Бүгүн кайрадан математика сабагы. Сабактын темасы "Факториал" Мугалим бул жолу Сандын факториалын таап келүү тапшырмасын берди.
# Сабак учурунда кичинекей сандардын факториалын эсептегендиктен үй тапшырма жеңил сезилди.
# Ошондуктан Азамат тапшырманы аткарбады. Сабакка бир күн калганда чоң сандардан турган факториал эсептөөчү тапшырманы көрүп
# сандын факториалын эсептөөчү программа жазууну  ойлонду. Ал "Окурмэн" окуу борборунун Р11 группасынан жардам сурап кайрылды
# Бизге бир n саны берилет, Биз ал сандын факториалын эсептөөчү программа жазабыз 
# n = int(input("Бир сан жазыңыз: "))
# factorial = 1  #өзгөрмөнүн маанисин 1ге барабарлайбыз
# for i in range(1, n + 1): # 1 ден n ге чейин цикл иштейт
#     factorial *= i  # Учурдагы санга көбөйтөбүз
# print("Сиз жазган сандын факториалы:", factorial)


#####---Кошумча тапшырма 
# Берилген диапозон аралыгындагы сандардын суммасын
# жана ал сандардын канчоосу так сан канчоосу жуп сан
# экенин чыгарган программа түзүңүз
# 
# a = int(input("Биринчи санды жазыңыз a: "))
# b = int(input("Экинчи санды жазыңыз b: "))
# sum_of_numbers = 0
# even_number = 0
# odd_number = 0
# for i in range(a, b + 1):
#     sum_of_numbers += i
#     if i % 2 == 0:
#         even_number += 1
#     else:
#         odd_number += 1
# print(f"Сандардын суммасы: {sum_of_numbers}")
# print(f"Жуп сандар: {even_number}")
# print(f"Так сандар: {odd_number}")


#####-----Кошумча тапшырма----
# s = input("Англисче текст жазыңыз: ").lower()
# unduu = "aeiouy"
# unsuz_tamga = 0
# unduu_tamga = 0
# for i in s:
#     if i in unduu:
#         unduu_tamga += 1
#     elif char.isalpha():  # символ тамгабы текшерет
#         unsuz_tamga += 1
# print(f"Үндүү: {unduu_tamga}")
# print(f"Үнсүз: {unsuz_tamga}")


######Кош цикл
# n = int(input())
# for i in range(1, n+1):  # сырткы цикл
#     for j in range(1, 11):  #ички цикл
#         print(f"{i} * {j} = {i * j}")
#     print('----------------')  # бош аралык
