# #Тема: Список(list)---Тизме
# """Список(list) - Бул иреттелген жана өзгөрүүчү коллекция деп айтсак болот,
# мындайча айтканда список ар кандай объектерди өзүнө камтуусу мүмкүн
#      (анын ичинде ички тизмелер да кирет)
#          же эч нерсе сакталбашы мүмкүн.
# Python тилинде список каша менен жазылат![]"""

# """ Списки (list):

# упордочение изменяемые последовательности.
# Примеры:"""

# my_list = [1, 2, 3, 'Python', True,[list, 123, 5678j]]

# #append(): Добавляет элемент в конце списка
# my_list = [1, 2, 3]
# my_list.append(4) #my_list[1, 2, 3, 4]

# #inseret(): Вставляет элемент по указанному индексу
# numbers = [1, 2, 3]
# numbers.insert(1, 10) #numbers = [1, 10, 2, 3]

# #remove(): Удаляет первое вхождение элемента из списка
# numbers = [1, 2, 3, 2, 4]
# numbers.remove(2)  #numers = [1, 3, 2, 4]

# #index(). Возвращает индекс первого вхождение элемента в списке
# fruits = ['apple', 'orange', 'watermelon']
# index_pear = fruits.index('orange')  #index_pear = 1

# #sort(). Сортирует элементы списка
# numbers = [3, 1, 4, 1, 5, 9, 2]
# numbers.sort() # numbers = [1, 1, 2, 3, 4, 5, 9]

# ### Списоктун функциялары##################
# # функция len() Бул функция тизмеде кана элемент бар экенин аныктап берет
# list = [1, 2, 3, 4]
# print(len(list))

# # Функция max()  Бул функция тизме элементтериндеги эң чоң санды бизге чыгарып берет
# list = [1, 2, 3, 4]
# print(max(list))

# # Функция min()  Бул функция тизме элементтериндеги эң кичине санды бизге чыгарып берет
# list = [1, 2, 3, 4]
# print(min(list))

# #sorted() Функция  Бул функция тизмедеги элементтерди ирети менен чыгарып берет'
# list = [1, 2, 3, 35, 55, 4]
# print(sorted(list))

# # Функция sum()  Бул функция тизме элементтериндеги бардык элементтердин суммасы бизге чыгарып берет
# list = [1, 2, 3, 35, 55, 4]
# print(sum(list))

# #####Списоктун операторлору############
# #Кошуу оператору +
# #Бул оператор эки тизмени кошуу кызматын аткарат
# a = [1]
# b = [2]
# print(a+b)
# f = a[1]+a[2]
# print(f)
# # in() оператору бул оператор тизме элементинде биз издеген элемент бар же жоктугун аныктап берет
# # Эгер бар болсо True жок болсо False чыгарып берет
# list = [1, 'Python', 2]
# print(0 in list)

# # Оператор del() Бул оператор тизме элементтерин жок кылат
# #Индекс аркылуу
# list = [1, 34, 2]
# del list[2]
# print(list)

# ##  1
# list = [10, 20, 30]
# # list.append([40, 50])
# list.append(40)
# list.append(50)
# list.insert(2, 15)
# print(list)

# ##   2
# list = [1, 5, 3, 5, 7, 5]
# list.remove(5)
# print(list)

# ##   3
# fruits = ['яблоко', 'банан', 'вишня', 'груша']
# index_pear = fruits.index('вишня')
# print(index_pear)

# ##   4
# list = [8, 3, 5, 2, 9, 1]
# list.sort()
# print(list)

# ##   5
# list = [2, 4, 6, 8, 10, 12, 14]
# a = list[0:7:1]
# print(a)